#include <stdio.h>

int main5() {
	// 포인터: 가리키다, 변수 또는 함수 주소를 가리킨다.
	// 포인터 변수: 변수의 위치를 기억하는 변수 (가리킨 공간의 주소값 저장하는 공간)
	// 굉장히 어렵고, 위험한 기술이기 때문에 많은 언어에서 없앤 문법 (컴퓨터 자체가 갖고 있는 기술)

	// C언어는 Bell 연구소
	// B언어 (포인터 X) ==> C언어 (포인터O)
	// 동시에 다른 언어들도 빼오던 문법인데 왜 도입을 했나
	// C언어는 운영체제를 만들기 위해 만들어진 문법 (유닉스, 윈도우, 리눅스, 맥OS, ...)
	// 미래의 어떤 프로그램이 만들어질지 어떤 신규 기능이 추가될지 알지 못함
	// num 변수를 사용해라 ==> 이곳에 위치할 기능을 동작시켜라
	// main 함수를 사용해라 ==> 이곳에 위치할 함수를 동작시켜라

	// 그래서, 포인터는 위치(주소)를 가리키는 기술

	int num = 10;		// num 변수의 주소를 저장해보자
	int* p_num = &num;		// num 변수가 위치한 주소를 p_num 포인터 변수에 저장해라
	
	// 자료형 앞의 *: 포인터 변수 생성
	// &: 주소참조자
	// *: 역참조
	printf("역참조: %d\n", *p_num);		// p_num이 갖고있는 주소에 들어가라! 라는 표현으로 앞에 *을 달아준다. 그 주소 안에 무슨 값이 있는지 나타냄
	printf("주소값: %p\n", p_num);		// 주소값
	printf("주소값: %p\n", &num);		// 주소값
	printf("변수값: %d\n", num);			// num의 값

	return 0;
}